<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"s3","backend":"359399df0983880ce98f22058ed22e87e0055964ea1a623b62eab5d89ee3c5a1","plan_job_ref":"Job terraform-plan-03-aws-github-actions-oidc #87 at https://github.com/pipetail/terraform/actions/runs/4796931713","plan_hash":"725bd7f8c49f8ee9e1af5264a0e7359270763ed5466c0902a51ae757346e2134","plan_text_format":"text","version":"1.34.0"} -->
Terraform plan in __examples/03-aws-github-actions-oidc__
<details>
<summary>Plan: 3 to add, 0 to change, 2 to destroy, 1 to move.</summary>

```hcl
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  - destroy
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_iam_role_policy.github_actions_push_to_ecr must be replaced
-/+ resource "aws_iam_role_policy" "github_actions_push_to_ecr" {
      ~ id     = "*****************************************" -> (known after apply)
        name   = "github-actions-push-to-ecr"
      ~ role   = "github_actions" -> "github_actions_deployer" # forces replacement
        # (1 unchanged attribute hidden)
    }

  # module.github_oidc_custom_policy.aws_iam_openid_connect_provider.github has moved to module.github_oidc_custom_policy.aws_iam_openid_connect_provider.github[0]
    resource "aws_iam_openid_connect_provider" "github" {
        id              = "arn:aws:iam::175912345102:oidc-provider/token.actions.githubusercontent.com"
        tags            = {}
        # (5 unchanged attributes hidden)
    }

  # module.github_oidc_custom_policy.aws_iam_role.github_actions will be destroyed
  # (because resource uses count or for_each)
  - resource "aws_iam_role" "github_actions" {
      - arn                   = "arn:aws:iam::175912345102:role/github_actions" -> null
      - assume_role_policy    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "sts:AssumeRoleWithWebIdentity"
                      - Condition = {
                          - StringLike = {
                              - "token.actions.githubusercontent.com:sub" = "*************************"
                            }
                        }
                      - Effect    = "Allow"
                      - Principal = {
                          - Federated = "arn:aws:iam::175912345102:oidc-provider/token.actions.githubusercontent.com"
                        }
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> null
      - create_date           = "2022-09-02T10:15:21Z" -> null
      - force_detach_policies = false -> null
      - id                    = "github_actions" -> null
      - managed_policy_arns   = [] -> null
      - max_session_duration  = 3600 -> null
      - name                  = "github_actions" -> null
      - path                  = "/" -> null
      - tags                  = {} -> null
      - tags_all              = {} -> null
      - unique_id             = "AROASR5JRLYHNFYWMJDQV" -> null

      - inline_policy {
          - name   = "github-actions-push-to-ecr" -> null
          - policy = jsonencode(
                {
                  - Statement = [
                      - {
                          - Action   = [
                              - "ecr:UploadLayerPart",
                              - "ecr:PutImage",
                              - "ecr:InitiateLayerUpload",
                              - "ecr:GetDownloadUrlForLayer",
                              - "ecr:CompleteLayerUpload",
                              - "ecr:BatchGetImage",
                              - "ecr:BatchCheckLayerAvailability",
                            ]
                          - Effect   = "Allow"
                          - Resource = "arn:aws:ecr:eu-west-1:175912345102:repository/test"
                          - Sid      = ""
                        },
                    ]
                  - Version   = "2012-10-17"
                }
            ) -> null
        }
    }

  # module.github_oidc_custom_policy.aws_iam_role.github_actions["github_actions_deployer"] will be created
  + resource "aws_iam_role" "github_actions" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRoleWithWebIdentity"
                      + Condition = {
                          + StringLike = {
                              + "token.actions.githubusercontent.com:sub" = "*************************"
                            }
                        }
                      + Effect    = "Allow"
                      + Principal = {
                          + Federated = "arn:aws:iam::175912345102:oidc-provider/token.actions.githubusercontent.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "github_actions_deployer"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)
    }

  # module.github_oidc_custom_policy.aws_iam_role.github_actions["github_actions_terraform"] will be created
  + resource "aws_iam_role" "github_actions" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRoleWithWebIdentity"
                      + Condition = {
                          + StringLike = {
                              + "token.actions.githubusercontent.com:sub" = "***************************"
                            }
                        }
                      + Effect    = "Allow"
                      + Principal = {
                          + Federated = "arn:aws:iam::175912345102:oidc-provider/token.actions.githubusercontent.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = [
          + "arn:aws:iam::aws:policy/AmazonEC2ContainerRegistryPowerUser",
        ]
      + max_session_duration  = 3600
      + name                  = "github_actions_terraform"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)
    }

Plan: 3 to add, 0 to change, 2 to destroy.
```
</details>

:memo: Plan generated in [terraform-plan-03-aws-github-actions-oidc #87](https://github.com/pipetail/terraform/actions/runs/4796931713)